
var files = {

    "1850": [
        "\\1850\\1.png"
    ],
    "1890": [
        "\\1890\\2.png",
        "\\1890\\3.png",
        "\\1890\\4.png"
    ],
    "1901": [
        "\\1901\\6.png"
    ],
    "1902": [
        "\\1902\\7.png"
    ],
    "1907": [
        "\\1907\\8.png"
    ],
    "1908": [
        "\\1908\\10.png",
        "\\1908\\9.png"
    ],
    "1910": [
        "\\1910\\11.png"
    ],
    "1926": [
        "\\1926\\12.png",
        "\\1926\\13.png",
        "\\1926\\14.png",
        "\\1926\\15.png",
        "\\1926\\16.png"
    ],
    "1931": [
        "\\1931\\17.png",
        "\\1931\\18.png",
        "\\1931\\19.png",
        "\\1931\\20.png",
        "\\1931\\21.png",
        "\\1931\\22.png",
        "\\1931\\23.png",
        "\\1931\\24.png",
        "\\1931\\25.png"
    ],
    "1938": [
        "\\1938\\26.png",
        "\\1938\\27.png",
        "\\1938\\28.png",
        "\\1938\\29.png",
        "\\1938\\30.png",
        "\\1938\\31.png",
        "\\1938\\32.png",
        "\\1938\\33.png",
        "\\1938\\34.png",
        "\\1938\\35.png",
        "\\1938\\36.png",
        "\\1938\\37.png",
        "\\1938\\38.png",
        "\\1938\\39.png",
        "\\1938\\40.png",
        "\\1938\\41.png"
    ],
    "1949": [
        "\\1949\\1.webp",
        "\\1949\\10.webp",
        "\\1949\\2.webp",
        "\\1949\\3.webp",
        "\\1949\\4.webp",
        "\\1949\\5.webp",
        "\\1949\\6.webp",
        "\\1949\\7.webp",
        "\\1949\\8.webp",
        "\\1949\\9.webp"
    ],
    "1950": [
        "\\1950\\19501.webp",
        "\\1950\\19502.webp",
        "\\1950\\19503.webp",
        "\\1950\\19504.webp",
        "\\1950\\19505.webp",
        "\\1950\\19506.webp",
        "\\1950\\19507.webp",
        "\\1950\\19508.webp",
        "\\1950\\19509.webp"
    ],
    "1960": [
        "\\1960\\196001.webp",
        "\\1960\\196002.webp",
        "\\1960\\196003.webp",
        "\\1960\\196004.webp",
        "\\1960\\196005.webp",
        "\\1960\\196006.webp",
        "\\1960\\196007.webp",
        "\\1960\\196008.webp",
        "\\1960\\196009.webp"
    ],
    "1970": [
        "\\1970\\197001.webp",
        "\\1970\\197002.webp",
        "\\1970\\197003.webp",
        "\\1970\\197004.webp",
        "\\1970\\197006.webp",
        "\\1970\\197007.webp",
        "\\1970\\19705.webp"
    ],
    "1980": [
        "\\1980\\198001.webp",
        "\\1980\\198002.webp",
        "\\1980\\198003.webp",
        "\\1980\\198004.webp",
        "\\1980\\198005.webp",
        "\\1980\\198006.webp",
        "\\1980\\198007.webp",
        "\\1980\\198008.webp"
    ],
    "1990": [
        "\\1990\\199001.webp",
        "\\1990\\199002.webp",
        "\\1990\\199003.webp",
        "\\1990\\199004.webp",
        "\\1990\\199005.webp",
        "\\1990\\199006.webp",
        "\\1990\\199007.webp",
        "\\1990\\199008.webp",
        "\\1990\\199009.webp",
        "\\1990\\199010.webp",
        "\\1990\\199011.webp",
        "\\1990\\199012.webp",
        "\\1990\\199013.webp",
        "\\1990\\199014.webp",
        "\\1990\\199015.webp",
        "\\1990\\199016.webp",
        "\\1990\\199917.webp"
    ],
    "2000": [
        "\\2000\\02.jpg",
        "\\2000\\03.jpg",
        "\\2000\\200001.webp",
        "\\2000\\200002.webp",
        "\\2000\\200003.webp",
        "\\2000\\200004.webp",
        "\\2000\\200005.webp",
        "\\2000\\20007.webp"
    ],
    "2010": [
        "\\2010\\201001.jpeg",
        "\\2010\\201002.jpeg",
        "\\2010\\201003.webp",
        "\\2010\\201004.webp"
    ],

    "2023": [
        "\\2023\\0.png",
        "\\2023\\1.png",
        "\\2023\\10.png",
        "\\2023\\100.png",
        "\\2023\\101.png",
        "\\2023\\102.png",
        "\\2023\\103.png",
        "\\2023\\104.png",
        "\\2023\\105.png",
        "\\2023\\106.png",
        "\\2023\\107.png",
        "\\2023\\11.png",
        "\\2023\\12.png",
        "\\2023\\13.png",
        "\\2023\\14.png",
        "\\2023\\15.png",
        "\\2023\\16.png",
        "\\2023\\17.png",
        "\\2023\\18.png",
        "\\2023\\19.png",
        "\\2023\\2.png",
        "\\2023\\20.png",
        "\\2023\\21.png",
        "\\2023\\22.png",
        "\\2023\\23.png",
        "\\2023\\24.png",
        "\\2023\\25.png",
        "\\2023\\26.png",
        "\\2023\\27.png",
        "\\2023\\28.png",
        "\\2023\\29.png",
        "\\2023\\3.png",
        "\\2023\\30.png",
        "\\2023\\31.png",
        "\\2023\\32.png",
        "\\2023\\33.png",
        "\\2023\\34.png",
        "\\2023\\35.png",
        "\\2023\\36.png",
        "\\2023\\37.png",
        "\\2023\\38.png",
        "\\2023\\39.png",
        "\\2023\\4.png",
        "\\2023\\40.png",
        "\\2023\\41.png",
        "\\2023\\42.png",
        "\\2023\\43.png",
        "\\2023\\44.png",
        "\\2023\\45.png",
        "\\2023\\46.png",
        "\\2023\\47.png",
        "\\2023\\48.png",
        "\\2023\\49.png",
        "\\2023\\5.png",
        "\\2023\\50.png",
        "\\2023\\51.png",
        "\\2023\\52.png",
        "\\2023\\53.png",
        "\\2023\\54.png",
        "\\2023\\55.png",
        "\\2023\\56.png",
        "\\2023\\57.png",
        "\\2023\\58.png",
        "\\2023\\59.png",
        "\\2023\\6.png",
        "\\2023\\60.png",
        "\\2023\\64.png",
        "\\2023\\65.png",
        "\\2023\\66.png",
        "\\2023\\67.png",
        "\\2023\\69.png",
        "\\2023\\7.png",
        "\\2023\\8.png",
        "\\2023\\80.png",
        "\\2023\\82.png",
        "\\2023\\83.png",
        "\\2023\\84.png",
        "\\2023\\88.png",
        "\\2023\\9.png",
        "\\2023\\90.png",
        "\\2023\\91.png",
        "\\2023\\92.png",
        "\\2023\\93.png",
        "\\2023\\94.png",
        "\\2023\\95.png",
        "\\2023\\96.png",
        "\\2023\\97.png",
        "\\2023\\98.png",
        "\\2023\\99.png"
    ]
};

var introduction = {

    "\\1850\\1.png": "这张照片是上海西门“仪凤门”\n初设城门6座，其中于肇嘉浜及\n其北边道路与城墙及其西沿城壕的十字交叉处，设一城门，初名仪凤门，因其位于城垣西缘，故习称西门。 后又因新辟尚文门 (小西门)而改称老西门至今。 清末的老西门前身——上海县凤仪门 参考阅读： 沪说 | 早朝宗，夕仪凤，而今飞到横泾边：上海县城及城门小史 清乾隆年间与同治年间，上海老城厢道路对比，原先路网稀疏的仪凤门一带，道路明显增加了。 （来源：上海历史地图集） “上海之最”不胜枚举之地 老西门的地域面积为1.24平方公里，不算大，但拥有“上海之最”可谓不胜枚举。 如上海市区唯一的儒教圣地文庙，又称“孔庙”，是上海市区唯一的一座祭祀孔子的古代建筑群，也是老城厢著名的现存名胜古迹之一，已有七百多年历史。 这里曾诞生了敬业、龙门、梅溪、蕊珠等闻名上海的四大书院。",
    "\\1890\\2.png": "街头的一辆载人的黄包车。",
    "\\1890\\3.png": "上海虹口菜市场成立于1890年，是上海历史悠久的传统菜市场之一。\n虹口菜市场位于上海市虹口区，地理位置便利，交通便捷。\n虹口菜市场是一个综合性的农副产品市场，提供各种新鲜的蔬菜、水果、肉类、海鲜等商品。市场内的摊位琳琅满目，货品丰富多样，消费者可以在这里找到几乎所有需要的食材。\n菜市场的环境整洁卫生，设施齐全。为了方便顾客购物，市场内设置有宽敞明亮的走廊和摊位，顾客可以舒适地选择所需商品。此外，菜市场还设有称重设备和支付设施，以方便顾客购买商品。\n虹口菜市场除了提供新鲜的食材外，还有一些小吃摊位和餐馆。顾客在购物之余，可以品尝到当地的特色美食，体验不同的口味。\n作为上海市的传统菜市场，虹口菜市场秉承着悠久的历史和丰富的文化底蕴。它不仅是居民购买食材的重要场所，也是一个展示当地市井文化和生活氛围的地方。",
    "\\1901\\6.png": "在消费水管前挑水的百姓。请注意，左边坐着的是自来水管理工",
    "\\1902\\7.png": "万国商团行走在南京路上，参加游行检阅。自行车当时是罕见品，注意右边的龙旗",
    "\\1907\\8.png": "英商上海电力公司雇佣工人在南京路上铺设电车轨道。\n这是上海第一条有轨电车，从静安寺到上海总会，全长6.04千米。",
    "\\1908\\9.png": "第一条有轨电车路线在公共租界开始运行",
    "\\1908\\10.png": "怡和洋行的主要管理和上海地方官员参加沪宁铁路全线通车典礼",
    "\\1910\\11.png": "上海外滩，万国建筑群已经成型",
    "\\1926\\12.png": "这张所拍的位置，据考证应该是“德国总会”楼上的瞭望亭，大楼1907年由德国人建成，\n此楼为意大利巴洛克式建筑风格，为上海外滩最为华丽的西式建筑，可惜第一次世界大战后，德国战败，\n此楼被中国银行收购，后拆毁于1937年建成至今，原楼也只能在照片中永存了",
    "\\1926\\13.png": "一对船民夫妻，小舟上满载货物，两人相互配合，女子在船头操控摇橹，丈夫在船尾撑篙，配合默契",
    "\\1926\\14.png": "南京东路和外滩交汇处的路口，一位印度阿三巡查正在执勤，只见他大腹便便，满脸络腮胡，头带包巾，\n这个瞬间见证了租界的这段屈辱历史。背后是和平饭店南楼，墙根荫凉处，一位西装外国人和一长衫中国人正在交谈。其他路人匆匆而过。",
    "\\1926\\15.png": "欧战胜利纪念碑，也叫和平女神碑，是当时租界工部局为纪念第一次世界大战协约国胜利而建造，\n1924年落成，与如今的气象信号台相邻，1941年日本占领期间，被日军故意拆毁",
    "\\1926\\16.png": "上海海关大楼前的栈桥，此时的海关大楼正在原址拆除重建，江边的栈桥上站满了商人，翘首以待，业务繁忙，\n栈桥背后的左起建筑是华俄道胜银行，后成为民 国 中央银行所在，如今是中国外汇交易中心。\n中间的高楼为上海第一幢高楼《字林西报》大楼，现为友邦保险大楼",
    "\\1931\\17.png": "位于虹口的食品市场，因上海生活的外国人达几十国，这里因此也汇聚了来自世界各地的食材",
    "\\1931\\18.png": "外滩鸟瞰，拍摄位置可能在气息信号台上所拍，此时的上海，西式建筑林立，道路宽敞，\n小轿车众多，码头处处，舟船往来者众。一派繁华之像",
    "\\1931\\19.png": "上海河南路的街景，不宽的道路，黄包车来回拉客，两旁商铺大多做的是绸缎生意，\n绸质旗帜挑入空中，大减价，大赠品促销不断，几乎都有着喜幛二字，\n那是因为旧中国，人们在祝贺新婚时，都会买上绸缎，上面附以贺联，祝贺主家",
    "\\1931\\20.png": "上海法国租界，路口人来人往，煞是热闹，街门上方一圈广告是：\n方九霞银楼，这是旧上海九大银楼之一，里边有宝大祥布庄，恒丰绸缎行",
    "\\1931\\21.png": "俯瞰黄浦江，江面宽阔，一艘巨轮正在迎面驶来，大小船舶穿行繁忙，浦江在这里拐了一道大弯，\n右边的陆地正是当下的陆家嘴，八十多年的时光，悠悠而过，如白驹过隙，\n当时的人们，谁也不会想到如今摩天高楼林立，竟已如此繁华",
    "\\1931\\22.png": "四马路青莲阁茶楼，楼分上下两层，楼下则是一处游乐场，表演唱曲杂耍，\n楼上喝茶观赏，是老上海著名的三教九流汇聚之所",
    "\\1931\\23.png": "城隍庙内豫园湖心亭，豫园始建于明朝嘉靖三十八年（公元1559年），由当时的刑部尚书潘恩之子潘允端在其家宅附近所造，\n而湖心亭则建于清乾隆年间，咸丰年间成为茶馆，百姓通过九曲桥游览豫园，同时在亭楼上休憩饮茶，观景之余，惬意无比",
    "\\1931\\25.png": "城隍庙湖心亭附近的鸟市场。各式鸟笼层层叠叠挂满铺面",
    "\\1938\\26.png": "上海南京路的街头夜色，车光如流，灯光璀璨，永安百货公司的招牌清晰可辨",
    "\\1938\\27.png": "位于江湾的上海市政府大楼，1933年建成，有著名建筑设计师董大酉按照传统宫殿的形式设计，现为上海市体育学院。图中已经被炮火损毁多处",
    "\\1938\\28.png": "日本信奉招魂文化，在上海所建的神社，门口更是停着一辆坦克，耀武扬威，\n为其侵华战争中死亡的军人招魂所用，其不仅活人欲占领中国，死人也想在中国安定，实在是欺人太甚。此处后来抗战胜利，被国人捣毁",
    "\\1938\\29.png": "此图近处的西式建筑为俄罗斯总领馆，由德国人设计，巴洛克建筑风格，\n1916年12月建成至今。苏州河与黄浦江交汇处的陆地，那时为绿地公园，如今是上海市人民英雄纪念塔的位置",
    "\\1938\\30.png": "是俄罗斯总领馆上俯瞰，下方为外白渡桥跨过苏州河。河下舟船鱼贯出入",
    "\\1938\\31.png": "北四川路（武进路以北）的一处转角，四层楼上赫然飘扬着日本海军旗，\n此处为侵华日军海军陆战队在上海的驻地。正是日本侵华的历史见证，每个人中国人如果不想遭受这样的屈辱，都当自强报国",
    "\\1938\\32.png": "南京路上，有轨电车，小汽车，黄包车、自行车各行其道，电车上清晰可见“可口可乐”的广告",
    "\\1938\\33.png": "吴淞路口，一位小女孩背着书包，歪着头看着，很是可爱。前方店铺的门楣写着“至诚当铺”",
    "\\1938\\34.png": "在外滩上巡逻的英国士兵",
    "\\1938\\35.png": "外滩近景，各国洋行，都高高飘扬着异国国旗，一排轿车停在路旁",
    "\\1938\\38.png": "苏州河畔，外白渡桥横跨两岸，各种民船停泊河内，除了运输或打鱼，主要就在船上生活",
    "\\1938\\39.png": "赛犬场，当时的人们除了竞马，还有以赛狗的活动，通过下注博彩，可见当时的奢靡之风",
    "\\1938\\40.png": "远瞰公共租界。一排排房屋整齐相邻，屋檐的曲线如同波浪般，连绵至远方",
    "\\1938\\41.png": "租界西边静安寺路的一处公园，池畔杨柳低垂，波光粼粼，风景虽好，却是亡国之所",
    "\\1949\\1.webp": "1949年5月28日欢庆上海解放的游行",
    "\\1949\\2.webp": "1949年5月外滩银行门口",
    "\\1949\\3.webp": "战争气息笼罩上海，街口储放着成列的军用板车",
    "\\1949\\4.webp": "1949年5月，陆陆续续有避难者离开上海",
    "\\1949\\5.webp": "由于战争的缘故，商家不得不把店面加固，防止暴乱",
    "\\1949\\6.webp": "一名断腿的伤病，行走在街头（突然想到情深深雨蒙蒙里的桥段）",
    "\\1949\\7.webp": "避难者正在登上一艘开往宁波的轮船",
    "\\1949\\8.webp": "一位即将离开上海的天主教牧师",
    "\\1949\\9.webp": "1949年5月27日上海解放，骑兵部队经过外百渡桥",
    "\\1949\\10.webp": "1949年5月28日欢庆上海解放的游行",
    "\\1950\\19501.webp": " 1950年，上海外滩，车来车往，好一派繁华景象，这里是中国最繁荣最开放的地方。",
    "\\1950\\19502.webp": "1950年，矗立在苏州河畔的百老汇大厦。百老汇大厦由英商业广地产公司于1930年投资兴建，1934年建成开业，它见证了上海的发展。",
    "\\1950\\19503.webp": " 1950年，上海街头的广告牌还不少。上海工商业的高度发展，也由此可见一斑。",
    "\\1950\\19504.webp": " 1950年，上海街头。",
    "\\1950\\19505.webp": " 1950年代，黄埔江畔。",
    "\\1950\\19506.webp": " 1950年代 南京路。",
    "\\1950\\19507.webp": " 1950年代 南京路。",
    "\\1950\\19508.webp": " 1950年代 南京路。",
    "\\1950\\19509.webp": " 1950年代，黄埔江畔。",
    "\\1960\\196001.webp": " 1962 甲板上的引水员",
    "\\1960\\196002.webp": " 1963 外滩，人行道",
    "\\1960\\196003.webp": "1963 儿童户外活动",
    "\\1960\\196004.webp": "1963 人民公园，划艇",
    "\\1960\\196005.webp": "1966 把音乐会开到军舰上",
    "\\1960\\196006.webp": "1967 街头革命舞蹈",
    "\\1960\\196007.webp": "1967 小学生晨跑",
    "\\1960\\196008.webp": "1967 公共汽车公司职工在车上学“毛著”",
    "\\1960\\196009.webp": "1967 充斥着标语的百货商店",
    "\\1970\\197001.webp": " 1971年闵行一条街 江川路",
    "\\1970\\197002.webp": "1971年滇池路近外滩",
    "\\1970\\197003.webp": " 1971年的邮政总局大楼",
    "\\1970\\197004.webp": " 黄浦公园",
    "\\1970\\19705.webp": "展览中心",
    "\\1970\\197006.webp": "1972年南京路",
    "\\1970\\197007.webp": "1973年里弄建筑",
    "\\1980\\198001.webp": "1980年，上海人民广场。",
    "\\1980\\198002.webp": "1980年，上海，黄浦江游船上游客，远处江面上有很多大大小小的船。",
    "\\1980\\198003.webp": "1980年，北京东路外滩42路，48路终点站候车队伍。",
    "\\1980\\198004.webp": "1980年，上海自行车还是主要的交通工具。",
    "\\1980\\198005.webp": "1980年，上海徐家汇车少人少。",
    "\\1980\\198006.webp": "在20世纪七八十年代，街头巷尾四处新款奔驰着这类公共汽车",
    "\\1980\\198007.webp": "上海的一外游玩景点，人非常多.",
    "\\1980\\198008.webp": "马路边卖服装、新鲜水果的摊点。",
    "\\1990\\199001.webp": "1990年，上海外滩。",
    "\\1990\\199002.webp": "1990年，新上海站.",
    "\\1990\\199003.webp": "1990年，上海城区，老城区的街道还普遍狭窄拥挤，城市建设还远没有如今这么发达。",
    "\\1990\\199004.webp": "1990年，上海，行驶在淮海路上的26路无轨电车。",
    "\\1990\\199005.webp": "1990年，上海浙江中路，是一条南北走向的繁华街道。",
    "\\1990\\199006.webp": "1990年，上海路，车来车往，川流不息。",
    "\\1990\\199007.webp": "1990年，上海弄堂，有着和谐邻里关系的弄堂老居民们。",
    "\\1990\\199008.webp": "1990年，上海，老城区开始大规模改造，孩子们放学后把拆后的废墟当成了游玩的场所。",
    "\\1990\\199009.webp": "1990年12月19日，上海证券交易所在上海浦江饭店正式挂牌成立。",
    "\\1990\\199010.webp": "1990年，上海弄堂里，卖油墩子的小店，锅里的油墩子让人馋涎欲滴。",
    "\\1990\\199011.webp": "90年代的上海是充满活力的。1990年，陆家嘴。",
    "\\1990\\199012.webp": "1994年，陆家嘴地区俯瞰。",
    "\\1990\\199013.webp": "1995年，陆家嘴地区俯瞰。",
    "\\1990\\199014.webp": "1996年，陆家嘴地区俯瞰。",
    "\\1990\\199015.webp": "1997年，陆家嘴地区俯瞰。 ",
    "\\1990\\199016.webp": "1998年，陆家嘴地区俯瞰。 ",
    "\\1990\\199917.webp": "1999年，陆家嘴地区俯瞰。",
    "\\2000\\200001.webp": "2000年，陆家嘴地区俯瞰。",
    "\\2000\\200002.webp": "2001年，陆家嘴地区俯瞰.",
    "\\2000\\200003.webp": "2002年，陆家嘴地区俯瞰。 ",
    "\\2000\\200004.webp": "2003年，陆家嘴地区俯瞰。",
    "\\2000\\200005.webp": "2005年，陆家嘴地区俯瞰。",
    "\\2000\\20007.webp": "2007年，陆家嘴地区俯瞰",
    "\\2000\\02.jpg": "　2000年的陆家嘴，东方明珠、金茂大厦相映生辉",
    "\\2000\\03.jpg": " 2000年的南京路",
    "\\2000\\04.jpg ": "2000年的南京路夜色。",
    "\\2010\\201001.jpeg": "世博会印象",
    "\\2010\\201002.jpeg": "世博会印象",
    "\\2010\\200103.webp": "中国馆",
    "\\2010\\201004.webp": "最受追捧的沙特馆",

}
// 
$(document).keydown(function (event) {
    if (event.keyCode == 27  && $("#show").hasClass("moveRight")) {
        hideShow();
    }
});
$(document).keydown(function (event) {
    let newclosestYear = getPrevYear(closestYear);

    if (event.keyCode == 37 && newclosestYear != closestYear  && $("#show").hasClass("moveRight")) {
        closestYear = newclosestYear;
        rePhoto();
    }
});
$(document).keydown(function (event) {
    if (event.keyCode == 40 && ind != files[closestYear].length - 1 && $("#show").hasClass("moveRight")) {
        ind++;
        rePhoto();
    }
});

$(document).keydown(function (event) {
    if (event.keyCode == 38 && ind != 0 && $("#show").hasClass("moveRight")) {
        ind--;
        rePhoto();
    }
});
function getNextYear(year) {
    let nextYear = Infinity;
    for (let y in files) {
        if (y > year && y < nextYear) {
            nextYear = y;
        }
    }
    return nextYear == Infinity ? year : nextYear;
}
function getPrevYear(year) {
    let prevYear = -Infinity;
    for (let y in files) {
        if (y < year && y > prevYear) {
            prevYear = y;
        }
    }
    return prevYear == -Infinity ? year : prevYear;
}
$(document).keydown(function (event) {
    // 离closestYear最近的下一个年份
    let newclosestYear = getNextYear(closestYear);

    if (event.keyCode == 39 && newclosestYear != closestYear && $("#show").hasClass("moveRight")) {
        closestYear = newclosestYear;
        rePhoto();
    }
});

// 下一年的函数
function nextYear() {
    let newclosestYear = getNextYear(closestYear);
    if (newclosestYear != closestYear && $("#show").hasClass("moveRight")) {
        closestYear = newclosestYear;
        ind = 0;
        rePhoto();
    }
}

// 上一年的函数
function prevYear() {
    let newclosestYear = getPrevYear(closestYear);
    if (newclosestYear != closestYear && $("#show").hasClass("moveRight")) {
        ind = 0;
        closestYear = newclosestYear;
        rePhoto();
    }
}

// 下一张的函数
function nextPhoto() {
    if (ind != files[closestYear].length - 1 && $("#show").hasClass("moveRight")) {
        ind++;
        rePhoto();
    }
}

// 上一张的函数
function prevPhoto() {
    if (ind != 0 && $("#show").hasClass("moveRight")) {
        ind--;
        rePhoto();
    }
}

let ind = 0;
let closestYear = 0;
let timer;


function rePhoto() {
    //清空id="sidebar"的元素中的内容
    $("#sidebar").empty();
    var fileList = files[closestYear];
    var randomFile = fileList[ind];

    // 遍历fileList
    for (var i = 0; i < fileList.length; i++) {
        // 创建一个img元素
        var img = $("<img>");
        // 设置img元素的src属性
        img.attr("src", ".\\素材" + fileList[i]);
        // 设置img元素的style属性width: 10%;height: 10%;
        img.attr("style", "width: 80%;height: 80%;box-shadow: 0.3rem 0.3rem 0.6rem var(--greyLight-2), -0.2rem -0.2rem 0.5rem var(--white);    border-radius: 0.8rem; margin-left:10%;height: auto;");
        // 设置img元素的onclick属性为 ind = i;rePhoto();
        img.attr("onclick", "ind = " + i + ";rePhoto();");
        // 将它放置到id="sidebar"的元素中
        $("#sidebar").append(img);
    }

    $("#show").removeClass("moveLeft");
    $("#show").addClass("moveRight");

    $("#image").attr("src", ".\\素材" + randomFile);

    $("#date").text("拍摄于" + closestYear);
    clearInterval(timer);

    $("#introduction").text("");
    var i = 0;
    if (closestYear == 2023) {
        var timer = setInterval(function () {
            $("#introduction").append("这是2023上海的照片，可见上海的繁荣景象".charAt(i));
            i++;
            if (i == "这是2023上海的照片，可见上海的繁荣景象".length) {
                clearInterval(timer);
            }
        }, 50);
    }
    else {
        if (introduction[randomFile] == undefined)
        {
            introduction[randomFile] = "这张照片没有介绍";
            console.log(randomFile);
        }
        timer = setInterval(function () {
            $("#introduction").append(introduction[randomFile].charAt(i));
            i++;
            if (i == introduction[randomFile].length) {
                clearInterval(timer);
            }
        }, 10);
    }

}
$(document).ready(function () {
    var timeline = $("#line");
    var tooltip = $("#tooltip");
    timeline.click(function (event) {
        var timelineWidth = timeline.width();
        var mouseX = event.pageX - timeline.offset().left;
        var startYear = 1850;
        var endYear = 2023;
        var timelineDuration = endYear - startYear;
        var currentYear = startYear + Math.round((mouseX / timelineWidth) * timelineDuration);

        ind = 0;
        closestYear = Object.keys(files).reduce(function (a, b) {
            return Math.abs(b - currentYear) < Math.abs(a - currentYear) ? b : a;
        });
        
        rePhoto();
    });

    timeline.mousemove(function (event) {
        var timelineWidth = timeline.width();
        var mouseX = event.pageX - timeline.offset().left;
        var startYear = 1850;
        var endYear = 2023;
        var timelineDuration = endYear - startYear;
        var currentYear = startYear + Math.round((mouseX / timelineWidth) * timelineDuration);

        tooltip.removeClass("hide");

        ind = 0;
        closestYear = Object.keys(files).reduce(function (a, b) {
            return Math.abs(b - currentYear) < Math.abs(a - currentYear) ? b : a;
        });

        tooltip.html(`<div class="year">${currentYear}</div><!-- <div class="back" style="width: 200px; height: 130px; background-size: cover; background-position: 50% 50%; background-image: url('/素材${files[closestYear][0]}')"></div> --> <img style="width: 200px; height: 130px; border-radius: 1rem" src="./素材${files[closestYear][0]}" />`);
        tooltip.css({ marginTop: '1%', position: 'fixed', left: event.pageX + 'px' }).show();
    });

    timeline.mouseleave(function () {
        tooltip.addClass("hide");
    });
});

var tooltip = $("#tooltip");
tooltip.hide();

// 定义一个添加id=show的元素的hide的class的函数
function hideShow() {
    clearInterval(timer);
    $("#show").addClass("moveLeft");
    var sidebar = $("#shou-sidebar");
    sidebar.css("left", "78%");
}

var sidebar = $("#shou-sidebar");
sidebar.hover(function() {
  sidebar.css("left", "78%");
});

$(document).click(function(event) {
  if (!sidebar.is(event.target) && sidebar.has(event.target).length === 0) {
    sidebar.css("left", "99%");
  }
});